Revit 2027 API
AnnotationFamilyUtils.IsExcludedFromLeaderOutline Method
 Checks if the element is excluded from the annotation outline used by leaders.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsExcludedFromLeaderOutline(
	Element element
)
Public Shared Function IsExcludedFromLeaderOutline (
	element As Element
) As Boolean
public:
static bool IsExcludedFromLeaderOutline(
	Element^ element
)
static member IsExcludedFromLeaderOutline :
        element : Element -> bool
Parameters
element Element
 The element to check.
Return Value
Boolean
 True if the element is excluded from the leader outline, false otherwise.
Exceptions
Exception | Condition
ArgumentException |  element doesn't support the EXCLUDE_FROM_LEADER_OUTLINE parameter.
ArgumentNullException |  A non-optional argument was null
Remarks
 This function controls the built-in parameter EXCLUDE_FROM_LEADER_OUTLINE.
See Also
Reference
AnnotationFamilyUtils Class
Autodesk.Revit.DB Namespace